other/stories.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 13:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Others</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Others</h1>
</header><p>
Every person learns at a different speed and that's ok.
</p>

<p>
Is your speed, and you'll be fine in the future if you are consistent.
</p>

<p>
Don't compare yourself to others because we tend to see only the good in them.
</p>

<p>
Learn at your pace.
</p>

<p>
Great point, everyone's journey is different. Just take small but
consistent steps everyday
</p>

<p>
autfu 的开源经历 <a href="https://antfu.me/posts/about-yak-shaving-zh">https://antfu.me/posts/about-yak-shaving-zh</a>
</p>

<p>
&#x2014;
</p>

<p>
Randy 的编程经历 <a href="https://lutaonan.com/blog/my-coding-road/">https://lutaonan.com/blog/my-coding-road/</a>
</p>

<p>
把自行车做成了自动驾驶 <a href="https://www.bilibili.com/video/BV1fV411x72a">https://www.bilibili.com/video/BV1fV411x72a</a>
</p>

<p>
钉钉创始人陈航的成长故事 <a href="https://cjxy.zust.edu.cn/info/1075/1727.htm">https://cjxy.zust.edu.cn/info/1075/1727.htm</a>
</p>

<p>
&#x2014;
</p>

<p>
丁红的奇特的、令我向往的人生经历（海马星球播客已被封杀）
<a href="https://www.jianguoyun.com/p/DWVRG5MQzZOlBxjFyaUE">https://www.jianguoyun.com/p/DWVRG5MQzZOlBxjFyaUE</a>
</p>

<ul class="org-ul">
<li>选择与自己志趣相投的朋友，拒绝不合适的朋友</li>
<li>有些事情，只有做了，才会看到，有很多人，在做和我一样的事情</li>
<li>考试这种事情，它不是个凭运气的问题；它的结果取决于，你花多少时间和毅力的问题</li>
<li>先试了再说，不要想着自己干不了；（6 分的时候做成了一件 10 分的事）一个机会只给你打 6 分，你要拼命争取那个机会，为什么？失败了是应该的，万一不小心成功了呢？如果你真的很努力地争取这些机会，你就会很努力地弥补这些不足，慢慢的你的能力就会往那个方向提高；如果一个机会给你打 10 分，那个机会本来就是你的，没有必要争，就看你要不要</li>
<li>对一件事的爱够不够？如果够，你就能够排除万难，做到你想做的事情</li>
</ul>

<p>
编程启蒙/从社区学习/个人竞争力（本期人物：Randy，AB）
<a href="https://binary.2bab.me/episodes/008-enlightenment-n-self-innovation">https://binary.2bab.me/episodes/008-enlightenment-n-self-innovation</a>
</p>

<ul class="org-ul">
<li>Randy 对编程的理解升华到信仰——《<a href="https://movie.douban.com/subject/3205624/">社交网络</a>》</li>
<li>Randy 的启蒙书《JavaScript DOM 编程艺术》和《JavaScript 高级程序设计》</li>
<li>了解做一件事，如何入手</li>
<li>人是不可靠的，让程序辅助自己编程</li>
<li>开源社区帮助 Randy 赚取名声</li>
<li>前端简历没有区分度</li>
<li>在技术社区和别人不一样</li>
<li>每天看 Twitter、HN：看别人怎么解决问题</li>
<li>听技术大会 JSConf，React Conf</li>
<li>习惯于英文技术环境</li>
</ul>

<p>
&#x2014;
</p>

<p>
maya 的故事，让我记忆深刻 <a href="https://www.xiaoyuzhoufm.com/episode/61257677cc5f215c6e0b868a?s=eyJ1IjoiNjA1NGU4NjFlMGY1ZTcyM2JiMjRjMzQ4In0%3D%0A">https://www.xiaoyuzhoufm.com/episode/61257677cc5f215c6e0b868a?s=eyJ1IjoiNjA1NGU4NjFlMGY1ZTcyM2JiMjRjMzQ4In0%3D%0A</a>
</p>

<ul class="org-ul">
<li>如何理解自己和父母的关系</li>
</ul>

<p>
&#x2014;
</p>

<p>
<a href="https://twitter.com/codingyuri/status/1437019319557308416?s=19">https://twitter.com/codingyuri/status/1437019319557308416?s=19</a>
</p>
<ul class="org-ul">
<li>做真实的自己</li>
<li>不知道一些事情是完全 OK 的</li>
<li>参与进自己的学习活动中</li>
<li>变得强大起来，不受别人的消极影响</li>
<li>建立有意义的链接</li>
</ul>

<p>
&#x2014;
</p>

<p>
<a href="https://mp.weixin.qq.com/s/z_-jB2bhL6HYyGHg2MzOcg">张一鸣：我的大学四年收获及工作感悟</a>
</p>

<ul class="org-ul">
<li>做好自己事情的同时，尽自己最大努力帮助别人解决问题</li>
<li>有好奇心，能够主动学习新事物、新知识和新技能</li>
<li>对不确定性保持乐观</li>
<li>不甘于平庸</li>
<li>不傲娇，要能延迟满足感</li>
<li>对重要的选择要有判断力</li>
</ul>

<p>
&#x2014;
</p>

<p>
<a href="https://www.xiaoyuzhoufm.com/episode/5fca27e0dee9c1e16d0eb010">Steve 说 212 期 - 杜素娟 - 文学是人生的后悔药</a>
</p>

<ul class="org-ul">
<li>建立多元价值体系，相信自己</li>
</ul>

<p>
&#x2014;
</p>

<p>
<a href="https://treecat.cn/%E5%85%A5%E8%81%8C%E5%B8%86%E8%BD%AF%E4%B8%80%E4%B8%AA%E5%8D%8A%E6%9C%88%E6%9C%89%E6%84%9F/">入职帆软一个半月有感</a>
</p>

<p>
&#x2014;
</p>

<p>
<a href="https://her.blue/about/">很美的页面</a>
</p>
</div>
</body>
</html>